import sqlite3

connection = sqlite3.connect("my_db.db")
cursor = connection.cursor()

cursor.execute('''
create table if not exists "уровень_обучения" (
"id_уровня" integer primary key not null unique,
"название" varchar(100)
)
''')

cursor.execute('''
create table if not exists "направления" (
"id_направления" integer primary key not null unique,
"название" varchar(100)
)
''')

cursor.execute('''
create table if not exists "типы_обучения" (
"id_типа" integer primary key not null unique,
"название" varchar(100)
)
''')

cursor.execute('''
create table if not exists "студенты" (
"id_студента" integer primary key not null unique,
"id_уровня" integer not null references "уровень_обучения"("id_уровня"),
"id_направления" integer not null references "направления"("id_направления"),
"id_типа_обучения" integer not null references "типы_обучения"("id_типа"),
"фамилия" varchar(100),
"имя" varchar(100),
"отчество" varchar(100),
"средний_балл" integer not null
)
''')

levels = [
    (1, 'Бакалавриат'),
    (2, 'Магистратура'),
    (3, 'Специалитет'),
    (4, 'Аспирантура')
]
cursor.executemany('INSERT OR IGNORE INTO "уровень_обучения" VALUES (?, ?)', levels)

directions = [
    (1, 'Прикладная Информатика'),
    (2, 'Программная Инженерия'),
    (3, 'Бизнес-Информатика'),
    (4, 'Информационные системы')
]
cursor.executemany('INSERT OR IGNORE INTO "направления" VALUES (?, ?)', directions)

study_types = [
    (1, 'очная'),
    (2, 'вечерняя'),
    (3, 'заочная')
]
cursor.executemany('INSERT OR IGNORE INTO "типы_обучения" VALUES (?, ?)', study_types)

students = [
    (1, 1, 1, 1, 'Иванов', 'Иван', 'Иванович', 92),
    (2, 1, 1, 1, 'Петрова', 'Анна', 'Сергеевна', 88),
    (3, 1, 1, 1, 'Сидоров', 'Петр', 'Алексеевич', 95),
    (4, 1, 1, 1, 'Кузнецова', 'Мария', 'Дмитриевна', 79),
    (5, 1, 1, 1, 'Волков', 'Алексей', 'Владимирович', 91),

    (6, 1, 2, 1, 'Смирнова', 'Екатерина', 'Павловна', 85),
    (7, 1, 2, 2, 'Попов', 'Дмитрий', 'Николаевич', 73),
    (8, 2, 2, 1, 'Лебедева', 'Ольга', 'Игоревна', 94),
    (9, 2, 2, 3, 'Новиков', 'Артем', 'Андреевич', 68),

    (10, 1, 3, 1, 'Федорова', 'Татьяна', 'Владимировна', 87),
    (11, 1, 3, 2, 'Морозов', 'Сергей', 'Михайлович', 76),
    (12, 2, 3, 1, 'Васильева', 'Наталья', 'Алексеевна', 90),
    (13, 2, 3, 3, 'Зайцев', 'Антон', 'Евгеньевич', 72),

    (14, 1, 4, 1, 'Соколова', 'Юлия', 'Сергеевна', 88),
    (15, 1, 4, 2, 'Михайлов', 'Владислав', 'Романович', 81),
    (16, 2, 4, 1, 'Андреев', 'Максим', 'Олегович', 93),
    (17, 2, 4, 3, 'Крылова', 'Елена', 'Витальевна', 75),

    (18, 3, 1, 3, 'Белов', 'Константин', 'Денисович', 66),
    (19, 3, 2, 3, 'Макарова', 'Ирина', 'Анатольевна', 71),
    (20, 4, 3, 3, 'Орлов', 'Григорий', 'Викторович', 82),

    (21, 1, 1, 2, 'Кузнецова', 'Анна', 'Игоревна', 89),
    (22, 1, 2, 1, 'Иванов', 'Иван', 'Иванович', 78),
    (23, 2, 1, 1, 'Иванов', 'Иван', 'Иванович', 84),
    (24, 1, 3, 2, 'Петрова', 'Анна', 'Сергеевна', 86),
    (25, 2, 3, 1, 'Смирнова', 'Екатерина', 'Павловна', 79)
]

cursor.executemany('''
INSERT OR IGNORE INTO "студенты" 
("id_студента", "id_уровня", "id_направления", "id_типа_обучения", "фамилия", "имя", "отчество", "средний_балл")
VALUES (?, ?, ?, ?, ?, ?, ?, ?)
''', students)

connection.commit()

print("1. Кол-во всех студентов: ")
cursor.execute('select count(*) from "студенты"')
print(cursor.fetchall()[0][0])
print()
print("2. Кол-во студентов по направлениям: ")
cursor.execute('select "название", count(*) from "студенты" '
               'join "направления" on "студенты"."id_направления" = "направления"."id_направления" '
               'group by "направления"."id_направления"')
print(cursor.fetchall())
print()
print("3. Кол-во студентов формам обучения: ")
cursor.execute('''
select "название", count(*) from "студенты" join "типы_обучения"
on "студенты"."id_типа_обучения" = "типы_обучения"."id_типа"
group by "типы_обучения"."id_типа"
''')
print(cursor.fetchall())
print()
print("4. Максимальный, минимальный, средний баллы студентов по направлениям: ")
cursor.execute('''
select "название", max("студенты"."средний_балл"), min("студенты"."средний_балл"), avg("студенты"."средний_балл")
from "студенты" join "направления" on "студенты"."id_направления" = "направления"."id_направления"
group by "направления"."id_направления"
''')
print(cursor.fetchall())
print()
print("5. Средний балл студентов по направления, уровням и формам обучения")
cursor.execute('''
select "направления"."название", "уровень_обучения"."название", "типы_обучения"."название", avg("студенты"."средний_балл")
from "студенты" join "направления" on "студенты"."id_направления" = "направления"."id_направления"
join "уровень_обучения" on "студенты"."id_уровня" = "уровень_обучения"."id_уровня"
join "типы_обучения" on "студенты"."id_типа_обучения" = "типы_обучения"."id_типа"
group by "направления"."id_направления", "уровень_обучения"."id_уровня", "типы_обучения"."id_типа"
ORDER BY 
    "направления"."название",
    "уровень_обучения"."название",
    "типы_обучения"."название"
''')
print(cursor.fetchall())
print()
print('''6. Для приказа о назначении повышенной стипендии необходимо отобрать 5
студентов направления Прикладная Информатика очной формы обучения ( отбор
по среднему баллу)''')
cursor.execute('''
select "студенты"."фамилия", "студенты"."имя", "студенты"."отчество", "студенты"."средний_балл"
from "студенты" JOIN "направления" ON "студенты"."id_направления" = "направления"."id_направления"
JOIN "типы_обучения" ON "студенты"."id_типа_обучения" = "типы_обучения"."id_типа"
where "направления"."название" = 'Прикладная Информатика'
and "типы_обучения"."название" = 'очная'
order by "студенты"."средний_балл"
limit 5
''')
print(cursor.fetchall())
print()
print("7. Сколько однофамильцев в данной базе?")
cursor.execute('''
select "фамилия", count(*)
from "студенты"
group by "фамилия"
having count(*) > 1
''')
print(cursor.fetchall())
print()
print("8. Есть ли среди обучающихся полные тезки (совпадают фамилии, имена, отчества)")
cursor.execute('''
select "фамилия", "имя", "отчество", count(*)
from "студенты"
group by "фамилия", "имя", "отчество"
having count(*) > 1
''')
print(cursor.fetchall())
connection.close()