import sqlite3

connection = sqlite3.connect("my_db.db")
cursor = connection.cursor()

cursor.execute('''
create table if not exists "уровень_обучения" (
"id_уровня" integer primary key not null unique,
"название" varchar(100)
)
''')

cursor.execute('''
create table if not exists "направления" (
"id_направления" integer primary key not null unique,
"название" varchar(100)
)
''')

cursor.execute('''
create table if not exists "типы_обучения" (
"id_типа" integer primary key not null unique,
"название" varchar(100)
)
''')

cursor.execute('''
create table if not exists "студенты" (
"id_студента" integer primary key not null unique,
"id_уровня" integer not null references "уровень_обучения"("id_уровня"),
"id_направления" integer not null references "направления"("id_направления"),
"id_типа_обучения" integer not null references "типы_обучения"("id_типа"),
"фамилия" varchar(100),
"имя" varchar(100),
"отчество" varchar(100),
"средний_балл" integer not null
)
''')

levels = [
    (1, 'Бакалавриат'),
    (2, 'Магистратура'),
    (3, 'Специалитет'),
    (4, 'Аспирантура')
]
cursor.executemany('INSERT OR IGNORE INTO "уровень_обучения" VALUES (?, ?)', levels)

directions = [
    (1, 'Прикладная Информатика'),
    (2, 'Программная Инженерия'),
    (3, 'Бизнес-Информатика'),
    (4, 'Информационные системы')
]
cursor.executemany('INSERT OR IGNORE INTO "направления" VALUES (?, ?)', directions)

study_types = [
    (1, 'очная'),
    (2, 'вечерняя'),
    (3, 'заочная')
]
cursor.executemany('INSERT OR IGNORE INTO "типы_обучения" VALUES (?, ?)', study_types)

students = [
    (1, 1, 1, 1, 'Иванов', 'Иван', 'Иванович', 92),
    (2, 1, 1, 1, 'Петрова', 'Анна', 'Сергеевна', 88),
    (3, 1, 1, 1, 'Сидоров', 'Петр', 'Алексеевич', 95),
    (4, 1, 1, 1, 'Кузнецова', 'Мария', 'Дмитриевна', 79),
    (5, 1, 1, 1, 'Волков', 'Алексей', 'Владимирович', 91),

    (6, 1, 2, 1, 'Смирнова', 'Екатерина', 'Павловна', 85),
    (7, 1, 2, 2, 'Попов', 'Дмитрий', 'Николаевич', 73),
    (8, 2, 2, 1, 'Лебедева', 'Ольга', 'Игоревна', 94),
    (9, 2, 2, 3, 'Новиков', 'Артем', 'Андреевич', 68),

    (10, 1, 3, 1, 'Федорова', 'Татьяна', 'Владимировна', 87),
    (11, 1, 3, 2, 'Морозов', 'Сергей', 'Михайлович', 76),
    (12, 2, 3, 1, 'Васильева', 'Наталья', 'Алексеевна', 90),
    (13, 2, 3, 3, 'Зайцев', 'Антон', 'Евгеньевич', 72),

    (14, 1, 4, 1, 'Соколова', 'Юлия', 'Сергеевна', 88),
    (15, 1, 4, 2, 'Михайлов', 'Владислав', 'Романович', 81),
    (16, 2, 4, 1, 'Андреев', 'Максим', 'Олегович', 93),
    (17, 2, 4, 3, 'Крылова', 'Елена', 'Витальевна', 75),

    (18, 3, 1, 3, 'Белов', 'Константин', 'Денисович', 66),
    (19, 3, 2, 3, 'Макарова', 'Ирина', 'Анатольевна', 71),
    (20, 4, 3, 3, 'Орлов', 'Григорий', 'Викторович', 82),

    (21, 1, 1, 2, 'Кузнецова', 'Анна', 'Игоревна', 89),
    (22, 1, 2, 1, 'Иванов', 'Иван', 'Иванович', 78),
    (23, 2, 1, 1, 'Иванов', 'Иван', 'Иванович', 84),
    (24, 1, 3, 2, 'Петрова', 'Анна', 'Сергеевна', 86),
    (25, 2, 3, 1, 'Смирнова', 'Екатерина', 'Павловна', 79)
]

cursor.executemany('''
INSERT OR IGNORE INTO "студенты" 
("id_студента", "id_уровня", "id_направления", "id_типа_обучения", "фамилия", "имя", "отчество", "средний_балл")
VALUES (?, ?, ?, ?, ?, ?, ?, ?)
''', students)

connection.commit()

print("1. Запрос с CASE")
cursor.execute('''
select "фамилия", "имя", "отчество",
case when "средний_балл" >= 90 then 'Отлично'
when "средний_балл" >= 75 and "средний_балл" <= 89 then 'Хорошо'
when "средний_балл" >= 60 and "средний_балл" <= 74 then 'Удовлетворительно'
when "средний_балл" < 60 then 'Неудовлетворительно'
end
from "студенты"
''')
print(cursor.fetchall())
print()

print("2. Запрос с CASE")
cursor.execute('''
select "студенты"."фамилия", "студенты"."имя", "уровень_обучения"."название",
case when "студенты"."id_уровня" = 1 then 'Начальная'
when "студенты"."id_уровня" = 2 then 'Начальная'
when "студенты"."id_уровня" = 3 then 'Продвинутый'
when "студенты"."id_уровня" = 4 then 'Элитный'
end
from "студенты" join "уровень_обучения" on "студенты"."id_уровня" == "уровень_обучения"."id_уровня"
''')
print(cursor.fetchall())
print()

print("3. Запрос с подзапросами")
cursor.execute('''
select "фамилия", "имя", "отчество", "средний_балл"
from "студенты"
where "средний_балл" > (
    select avg("средний_балл")
    from "студенты"
    where "id_направления" = (
        select "id_направления"
        from "направления"
        where "название" = 'Прикладная Информатика'
    )
)
''')
print(cursor.fetchall())
print()

print("4. Запрос с подзапросами")
cursor.execute('''
select "название", (
    select max("средний_балл")
    from "студенты"
    where "студенты"."id_направления" = "направления"."id_направления"
)
from "направления"
where (
    select max("средний_балл")
    from "студенты"
    where "студенты"."id_направления" = "направления"."id_направления"
) > (
    select avg("средний_балл")
    from "студенты"
)
''')
print(cursor.fetchall())
print()

print("5. Запрос с CTE")
cursor.execute('''
with "top_students" as (
    select "фамилия", "имя", "средний_балл", "id_направления", "id_типа_обучения"
    from "студенты"
    order by "средний_балл" desc
    limit 3
)
select "top_students"."фамилия", "top_students"."имя", "top_students"."средний_балл",
"направления"."название", "типы_обучения"."название"
from "top_students"
join "направления" on "top_students"."id_направления" = "направления"."id_направления"
join "типы_обучения" on "top_students"."id_типа_обучения" = "типы_обучения"."id_типа"
''')
print(cursor.fetchall())
print()

print("6. Запрос с CTE" )
cursor.execute('''
with "students_count" as (
    select "уровень_обучения"."id_уровня", "уровень_обучения"."название",
    count("студенты"."id_студента") as "количество"
    from "уровень_обучения"
    left join "студенты" on "уровень_обучения"."id_уровня" = "студенты"."id_уровня"
    group by "уровень_обучения"."id_уровня", "уровень_обучения"."название"
)
select "название", "количество",
case when "количество" > 5 then 'Много'
     when "количество" >= 3 then 'Средне'
     else 'Мало'
end
from "students_count"
order by "количество" desc
''')
print(cursor.fetchall())
print()
